<?php

$map = ["Московская область" => ["Москва", "Зеленоград", "Клин"], "Ленинградская область" => ["Санкт-Петербург", "Всеволожск", "Павловск", "Кронштадт"], "Рязанская область" => ["Рязань", "Рыбное", "Шилово", "Шацк"]];



/* Этот код почему то не работает =((( */


foreach ($map  as $region => $city) {
	if ((substr($city, 0, 1) != "К") || (substr($city, 0, 1) != "к")) {
	$str[region] = implode ("", );
	}
	
	else {$str[region] = implode (", ", $city);}
	
	$str[region] .= "<br />";

	echo ("$region:<br /> $str[region], ");
}

	


?>